# INITIALISATION AND IMPORT SECTION
from colorama import Fore, init

init()

# WELCOME TEXT'S
print(Fore.GREEN + """ 
 ______   _______  _        _______           _        _______  _______ 
/ ___  \ (  ___  )( (    /|(  ____ \|\     /|( \      (  ___  )(  ____ )
\/   \  \| (   ) ||  \  ( || (    \/| )   ( || (      | (   ) || (    )|
   ___) /| (___) ||   \ | || |      | |   | || |      | (___) || (____)|
  (___ ( |  ___  || (\ \) || | ____ | |   | || |      |  ___  ||     __)
      ) \| (   ) || | \   || | \_  )| |   | || |      | (   ) || (\ (   
/\___/  /| )   ( || )  \  || (___) || (___) || (____/\| )   ( || ) \ \__
\______/ |/     \||/    )_)(_______)(_______)(_______/|/     \||/   \__/""")

print(Fore.WHITE + """

                      A
                     /|
                    / |
                   /  |
                  /   |
                 /    |
                /     |
               /      |
              /       |
             /       _|
            /_______|_| 
           B           C  
   
   """)

# QUESTIONS SECTION 
def Questions():
   print('\tЧто вы хотите сделать?\n')
   print('1. Найти площадь прямоугольного треугольника')
   print('2. Найти площадь произвольного треугольника')
   print('3. Найти синус угла ')
   print('4. Найти косинус угла ')
   print('5. Найти тангенс угла ')
   print('6. Найти котангенс угла ')
   print('7. Проверить, существует ли треугольник')

   print(Fore.GREEN + "Введите номер пункта: " + Fore.WHITE)
   action = input('')

   # MAIN LOGIC SECTION
   if action.isdigit() == True:
      print(100)
   else:
      print(Fore.RED + 'Ошибка! Нужно выбрать номер пункта \n' + Fore.WHITE)
      Questions()

Questions()